'''
Найдите сумму цифр трехзначного числа n.
Результат сохраните в перменную res.

Пример:
n = 123 -> res = 6 (1 + 2 + 3)

n = 100 -> res = 1 (1 + 0 + 0)
'''


if 1 == 11:
    number = int(input('Введите трехзначное число: '))

    firstdigit = number // 100
    seconddigit = (number % 100) // 10
    thirddigit = number % 10


    def sumdigitsfromnumber(number, d1, d2, d3):
        if number > 99 & number < 1000:
            return d1 + d2 + d3
        else:
            return "Вы ввели недопустимое значение!"    

    print(sumdigitsfromnumber(number, firstdigit, seconddigit, thirddigit))


'''
Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали n журавликов.
Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали одинаковое количество журавликов, 
а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?
Выведите через пробел количество журавликов, сделанных Петей, Катей и Сережей.

Пример:
n = 6 -> 1 4 1  
n = 24 -> 4 16 4    
n = 60 -> 10 40 10 
'''
if 1 == 11:
    n = int(input('Введите количество изготовленных журавликов: '))

    def countcrane(n):
        n1 = n // 6
        n2 = n1 * 4

        print(n1, n2, n1)

    countcrane(n)


'''
Вы пользуетесь общественным транспортом? Вероятно, вы расплачивались за проезд и получали билет с номером.
Счастливым билетом называют такой билет с шестизначным номером, 
где сумма первых трех цифр равна сумме последних трех.
Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6.
Вам требуется написать программу, 
которая проверяет счастливость билета с номером n и выводит на экран yes или no.

Пример:
n = 385916 -> yes
n = 123456 -> no
'''

if 1 == 11:
    n = int(input('Введите шестизначное число: '))
    firstnumber = n // 1000
    secondnumber = n % 1000

    def sumdigitsfromnumber(n):
        firstdigit = n // 100
        seconddigit = (n % 100) // 10
        thirddigit = n % 10
        return firstdigit + seconddigit + thirddigit

    if sumdigitsfromnumber(firstnumber) == sumdigitsfromnumber(secondnumber):
        print('yes')
    else:
        print('no')


'''
Определите, можно ли от шоколадки размером a × b долек отломить c долек, 
если разрешается сделать один разлом по прямой между дольками 
(то есть разломить шоколадку на два прямоугольника).
Выведите yes или no соответственно.

Пример:
a, b, c = 3, 2, 4 -> yes
a, b, c = 3, 2, 1 -> no
'''

side1 = int(input('Введите размер одной стороны шоколадки(в дольках): '))
side2 = int(input('Введите размер второй стороны шоколадки(в дольках): '))

n = int(input('Введите сколько долек вы хотите отломить: '))

def count(side1, side2, n):
    if n <= side1 * side2:
        if side1 == n or side1 % n == 0 or n % side1 == 0:
            print('yes')
        elif side2 == n or side2 % n == 0  or n % side2 == 0:
            print('yes')
        else: 
            print('no')
    else:
        print('Вы пытаетесь отломать неверное количество долек!')

count(side1, side2, n)