"""
Задача №1. Решение в группах
Семинар 1. Ввод-вывод, операторы ветвления
За день машина проезжает n километров. Сколько
дней нужно, чтобы проехать маршрут длиной m
километров? При решении этой задачи нельзя
пользоваться условной инструкцией if и циклами.
Input:
n = 700
m = 750
Output:
2

"""
import math

if 1 == 11:
    n = int(input('Сколько км проезжает машина за день: '))
    m = int(input('Сколько всего нужно проехать км: '))

    def howmanydays(m, n):
        # return math.ceil(m // n)
        return ((m + n - 1) // n)

    print(howmanydays(m, n))

'''
Задача №2. Решение в группах
В некоторой школе решили набрать три новых
математических класса и оборудовать кабинеты для
них новыми партами. За каждой партой может сидеть
два учащихся. Известно количество учащихся в
каждом из трех классов. Выведите наименьшее
число парт, которое нужно приобрести для них.
Input: 20 21 22(ввод чисел НЕ в одну строку)
Output: 32
'''

if 1 == 11:
    numberfirstclass = int(input('Введите количество учеников 1-ого класса: '))
    numbersecondclass = int(input('Введите количество учеников 2-ого класса: '))
    numberthirdclass = int(input('Введите количество учеников 3-ого класса: '))

    def howmanydesks(n1, n2, n3):
        result = (math.ceil((n1 + n2 + n3) / 2))
        print(result)

    howmanydesks(numberfirstclass, numbersecondclass, numberthirdclass)

'''
Задача №3. Решение в группах
Вагоны в электричке пронумерованы натуральными
числами, начиная с 1 (при этом иногда вагоны
нумеруются от «головы» поезда, а иногда – с
«хвоста»; это зависит от того, в какую сторону едет
электричка). В каждом вагоне написан его номер.
Витя сел в i-й вагон от головы поезда и обнаружил,
что его вагон имеет номер j. Он хочет определить,
сколько всего вагонов в электричке. Напишите
программу, которая будет это делать или сообщать,
что без дополнительной информации это сделать
невозможно.
Input: 3 4(ввод на разных строках)
Output: 6
'''

if 1 == 11:
    i = int(input('Введите номер вагона, в который сел Витя: '))
    j = int(input('Введите номер указанный в вагоне: '))
    if i - j == 0:
        res = 'Невозможно посчитать без дополнительной информации!'
    else:
        res = i + j - 1

    print(res)

'''
Задача №4. Решение в группах
Дано натуральное число. Требуется определить,
является ли год с данным номером високосным. Если
год является високосным, то выведите YES, иначе
выведите NO. Напомним, что в соответствии с
григорианским календарем, год является
високосным, если его номер кратен 4, но не кратен
100, а также если он кратен 400.
Input: 2016
Output: YES
'''

if 1 == 11:
    year = int(input('Введите натуральное число: '))

    def isleapyear(year):
        if year % 4 == 0 and year % 100 != 0 or year % 400 == 0:  
            print('YES')
        else:
            print('NO')

    isleapyear(year)